[{
    "title": "Sisters Coffee Company website redesign",
    "tag": "Helping a local coffee company reclaim their web presence",
    "description": "Over my winter break in 2018, I worked with a coffee company form Sisters, OR to help them update their Squarespace website. While the site had been set up with all the bells and whistles of a custom site, while still being hosted on Squarespace, the company now needed a version that they could work with in the future and update more easily. To that end, I worked with the owners to move the entire site to a new less-custom Squarespace site, and to redesign the website in the process. Additionally, I was coordinated the process of transitioning the old domains to point at the new and improved site. Over the course of the next year (2018-2019), this redesign led to a 33% increase in online sales for the company.",
    "download_link": "https://www.sisterscoffee.com",
    "link_text": "Visit the site"
},
{
    "title": "FEC Donation Aggregator",
    "tag": "Improving the transparency of individual donation data",
    "description": "In a foray into data analysis, I wrote a custom program for the Tufts Daily to better analyze donation information downloaded from the Federal Election Commission. When run, this program takes all of the donation data that can be found in a given file, often with many individual donations to the same committees, and adds them all together in the output so that they can be better analyzed and interpreted. More information can be found in the README file of the Github repository linked below.",
    "download_link": "https://github.com/jGowgiel/fec-donation-aggregator",
    "link_text": "View source on Github"
},
{
    "title": "This website",
    "tag": "Built from the ground up",
    "description": "I built this site itself as a personal project to continue improving my ability to develop websites and create content independently. This site is styled with Bootstrap, and uses the React framework under the hood, and I've been coming back to update it periodically. While the core frame was built during my senior year of college, I'm actively reworking and improving the site as needed and as time allows.",
    "download_link": "https://github.com/jGowgiel/portfolio_website",
    "link_text": "View source on Github"
},
{
    "title": "Tufts Food Finder",
    "tag": "Find out when your favorite food will be back in a Tufts dining hall",
    "description": "This site provides an interface for Tufts students (and any other interested people) to search through the Tufts dining menus for specific foods. After searching for a food, users are shown any matching menu items, as well as the location and time they will be available next.",
    "download_link": "https://tufts-food-finder.herokuapp.com/",
    "link_text": "Visit the site"
},
{
    "title": "Image compression and decompression",
    "tag": "Performs various rotational operations on a given image",
    "description": "This program rotates the provided image. It is designed to use two different data structures to store the image and perform the translations; either a blocked representation where each A x B section of the image is translated, or a representation where the image is represented by rows of pixels. This size of the section is determined by the program at runtime, and is optimized so that every block contains as close to 64KB of data as possible. The data structure to be used can be selected when the program is invoked.",
    "download_link": "code/40image_src.zip",
    "link_text": "Download Partial Source"
},
{
    "title": "Let's share pizza",
    "tag": "Connecting you with other nearby people who could also use a slice",
    "description": "As the final group project for COMP 20, a web programming course, my group designed and created a pizza sharing site. The app uses your current location, and seeks any nearby active orders on the site. Local pizza shops are retrieved using the Google Places API, and displayed on the map. After creating an order, you can sign up to be notified by text when other people connect to it. Once a full pizza has been 'crowd-sourced,' all parties are alerted so that they can continue the transaction. While still in beta, the site itself is functional.",
    "download_link": "https://lets-share-pizza.herokuapp.com",
    "link_text": "Visit the site"
},
{
    "title": "Image rotations",
    "tag": "Performs various rotational operations on a given image",
    "description": "This program rotates the provided image. It is designed to use two different data structures to store the image and perform the translations; either a blocked representation where each A x B section of the image is translated, or a representation where the image is represented by rows of pixels. This size of the section is determined by the program at runtime, and is optimized so that every block contains as close to 64KB of data as possible. The data structure to be used can be selected when the program is invoked.",
    "download_link": "code/locality.zip",
    "link_text": "Download Partial Source"
},
{
    "title": "Directory searching",
    "tag": "Indexes the given directory into a massive Try structure, and then searches through this index",
    "description": "As the final project for the Data Structures course at Tufts, students were tasked with imitating the functionality of the built-in grep command. Each student created a program that would index the files in a given directory, and then return any lines in this directory that matched the string that the user queried.",
    "download_link": "code/directory_search.zip",
    "link_text": "Download Partial Source"
}]
